Revit 2027 API
InstanceVoidCutUtils.GetElementsBeingCut Method
 Return ids of the elements being cut by the instance
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ICollection<ElementId> GetElementsBeingCut(
	Element cuttingInstance
)
Public Shared Function GetElementsBeingCut (
	cuttingInstance As Element
) As ICollection(Of ElementId)
public:
static ICollection<ElementId^>^ GetElementsBeingCut(
	Element^ cuttingInstance
)
static member GetElementsBeingCut :
        cuttingInstance : Element -> ICollection<ElementId>
Parameters
cuttingInstance Element
 The cutting family instance
Return Value
ICollection<ElementId>
 Ids of elements being cut by cuttingInstance
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
InstanceVoidCutUtils Class
Autodesk.Revit.DB Namespace